Art_Share_API/app/controllers/artworks_controller.rb

    def index
        params[:id]
        users= User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def create #create ...follow class[...]
        #debugger
        x = Artwork.new(artworks_params)
        if x.save #want to return false
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Gioconda"], ["image_url", "gioconda.png"], ["artist_id", 1]]

    def show
        artwork = Artwork.find(params[:id]) #only need id dont need top level id
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        artwork = Artwork.find(params[:id]) #only need id dont need top level id
        if artwork.update(artworks_params) #AR update method that acts on instance
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "La notte stellata"], ["id", 1]]