Art_Share_API/app/controllers/users_controller.rb

INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "peter"]]
---
    def create #create ...follow class[...]
        # debugger
        x = User.new(users_params)
        if x.save #want to return false

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        user = User.find(params[:id]) #only need id dont need top level id

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "toby@aa.com"], ["id", 2]]
---
    def update
        user = User.find(params[:id]) #only need id dont need top level id
        if user.update(users_params) #AR update method that acts on instance

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
    def destroy
        user = User.find(params[:id]) #only need id dont need top level id
        user.destroy